# koşullu eleman işlemleri

In [1]:
import numpy as np
import pandas as pd
n = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(n, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     2    13     2
1    28    29    26
2    19     5    17
3     7    27     7
4     5     7    10
5    14    20    29
6    19    11    28
7     9    18     7
8     4    23    22
9    27    29    13

In [2]:
df["var3"]

0     2
1    26
2    17
3     7
4    10
5    29
6    28
7     7
8    22
9    13
Name: var3, dtype: int32

In [3]:
df["var3"] [0:2]

0     2
1    26
Name: var3, dtype: int32

In [4]:
df[0:2]

   var1  var2  var3
0     2    13     2
1    28    29    26

In [6]:
df[0:2][["var1","var2"]]

   var1  var2
0     2    13
1    28    29

In [7]:
df

   var1  var2  var3
0     2    13     2
1    28    29    26
2    19     5    17
3     7    27     7
4     5     7    10
5    14    20    29
6    19    11    28
7     9    18     7
8     4    23    22
9    27    29    13

In [8]:
#var1 in 15 den büyük olma olasılığı

In [9]:
df.var1

0     2
1    28
2    19
3     7
4     5
5    14
6    19
7     9
8     4
9    27
Name: var1, dtype: int32

In [14]:
df[df.var1 > 15]

   var1  var2  var3
1    28    29    26
2    19     5    17
6    19    11    28
9    27    29    13

In [20]:
df[df.var1 > 15]["var1"]

1    28
2    19
6    19
9    27
Name: var1, dtype: int32

In [21]:
df

   var1  var2  var3
0     2    13     2
1    28    29    26
2    19     5    17
3     7    27     7
4     5     7    10
5    14    20    29
6    19    11    28
7     9    18     7
8     4    23    22
9    27    29    13

In [25]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [26]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
1    28    29
2    19     5
6    19    11
9    27    29

In [28]:
df.loc[(df.var1 > 15)][["var1","var2"]]

   var1  var2
1    28    29
2    19     5
6    19    11
9    27    29